In [1]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
sozlukVerisi={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
hdDf=pd.DataFrame(sozlukVerisi)

In [7]:
hdDf

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
hdDf.dropna()

   İstanbul  Ankara  Izmir
0      30.0    20.0     40

In [11]:
hdDf

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [13]:
hdDf.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [17]:
yeniVeri={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [19]:
yeniDataFrame

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
yeniDataFrame.dropna(axis=1,thresh=2)

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [23]:
yeniDataFrame.fillna(20)

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [40]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","İK","İK"],
            "Calisan Ismi": ["Ahmet","Mehmet","Ali","Veli","Deniz","Kuzey"],
            "Maas": [100,200,300,400,500,600]
            }

In [42]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [44]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   200
2  Pazarlama          Ali   300
3  Pazarlama         Veli   400
4         İK        Deniz   500
5         İK        Kuzey   600

In [60]:
groupObject=maasDataFrame.groupby("Departman")

In [62]:
groupObject

In [64]:
groupObject.count()

           Calisan Ismi  Maas
Departman
Pazarlama             2     2
Yazılım               2     2
İK                    2     2

In [68]:
groupObject.max()

          Calisan Ismi  Maas
Departman
Pazarlama         Veli   400
Yazılım         Mehmet   200
İK               Kuzey   600

In [70]:
groupObject.min()

          Calisan Ismi  Maas
Departman
Pazarlama          Ali   300
Yazılım          Ahmet   100
İK               Deniz   500

In [72]:
groupObject.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
İK          2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0